{"pageProps":{"file":{"data":{"templateKey":"post.template","title":"post5","date":"6/11/2021","subject":"tech","author":"Monique Siemsen","tags":["computer, hacken, processor, inbouwfout, Spectre"],"image":["https://res.cloudinary.com/dta9vptzh/image/upload/v1602325993/dennisStassen/dennis_voor_de_klas.jpg"],"slug":"post5"},"content":"De mensheid is vandaag de dag zeer afhankelijk van de computer. Gevaarlijk, want onderzoekers vonden een nieuwe kwetsbaarheid, die computers over de hele wereld makkelijk lam legt.\n\nThuis kunnen we onze laptop of pc al amper missen, laat staan hoe wereldwijde instituten het moeten redden als computersystemen zouden weg vallen of gehackt worden. Toch is dat precies de situatie die er dreigt en Amerikaanse techneuten trekken dan ook luid aan de bel. Ze hebben een foutje gevonden in de processors, waardoor computers kwetsbaarder zijn, dan we vermoeden.\n\n**Nieuwe Spectre fout gevonden in processors**\n\nHet team van de Universiteit in Virginia heeft de ontdekte fout zelfs een naam gegeven, te weten Spectre. Het betreft een inconsistentie in de hardware, die is ingebouwd in de processors van moderne computers.\n\n![Foto: Pixabay.com. De snelheid van onze computers, maakt ze zeer kwetsbaar voor hackers.](/img/man-vraagteken-computer.jpg)\n\nComputers vandaag de dag zijn zo snel omdat in die hardware gebruik wordt gemaakt van zogenaamde ‘speculative execution’ oftewel ‘uitvoering die kan speculeren’. Processors kunnen daarmee voorspellen welke handelingen van de gebruiker er volgen en zelfs op die voorspelde handelingen vooruitlopen. Denk daarbij bijvoorbeeld aan predictor functies als je iets wilt typen.\n\n**Computers om de tuin geleid en bestanden vrij toegankelijk**\n\nDe wetenschappers vonden een manier en een serie van aanvallen, waarmee de voorspelling omzeild kan worden. Met een Spectre-aanval is de voorspelling op het verkeerde pad te zetten. De processor heeft dat op een gegeven moment door, herstelt zich en gaat weer verder met de juiste voorspelling. De computer zal dan ook ogenschijnlijk netjes die taak afmaken, zoals dat de bedoeling is. Echter: terwijl de processor de bosjes in wordt gestuurd, kunnen hackers makkelijk toegang krijgen tot vertrouwelijke bestanden.\n\nDe deskundigen menen dat als zij dit trucje kunnen bedenken, het slechts een kwestie van tijd is voordat georganiseerde terreurgroepen, criminelen of zelfs kwaadwillende individuen, dezelfde route vinden in onze computers en zich een toegang kunnen verschaffen tot zeer vertrouwelijke en gevoelige bestanden.\n\n**Zal tweede Spectre fout op tijd hersteld worden?**\n\nHet is niet de eerste keer dat deze universiteit een niet zo’n kleine glitch ontdekt in de processors, dat was Spectre 1 dus eigenlijk, te weten al in 2018. Toen vonden de deskundigen al kwetsbaarheden, waarop de industrie meteen aan de gang ging om het euvel te verhelpen. Sceptisch over de eerste fout die ze vonden, ging het team na deze herstelwerkzaamheden, weer op onderzoek uit. En nu blijkt dus, met goede reden. Spectre next generation ligt op de loer.\n\nDe universiteit dringt er op aan dat fabrikanten weer razendsnel aan de bak gaan om ook Spectre 2 te verhelpen, voordat anderen de aanvals-route ontdekken. Overigens zijn de deskundigen vastbesloten ook het komende herstel weer grondig onder de loep te zullen nemen en zonodig met Spectre 3 op de proppen te komen, als het moet.\n\n*Gepubliceerd op 29.5.2021*\n\n*Bron: Computer scientists discover new vulnaribility affecting computers globally door University of Virginia School of Engineering and Aplied Science, Verenigde Staten*"}},"__N_SSG":true}